package com.wa.cluemrg.util;

import org.springframework.util.StringUtils;

import java.util.HashMap;
import java.util.Map;

public class JurisdictionUtil {

    private static Map<String,String> map = new HashMap<String,String>(){
        {
            put("广西三江侗族自治县公安局刑事侦查大队","三江县局");
            put("广西三江侗族自治县公安局河东派出所","三江县局");
            put("广西融水苗族自治县公安局刑事侦查大队","融水县局");
            put("广西融水苗族自治县公安局城南派出所","融水县局");
            put("广西融水苗族自治县公安局城北派出所","融水县局");
            put("广西融水苗族自治县公安局红水派出所","融水县局");
            put("广西融水苗族自治县公安局城东派出所","融水县局");
            put("广西融水苗族自治县公安局汪洞派出所","融水县局");
            put("广西融水苗族自治县公安局四荣派出所","融水县局");
            put("广西融水苗族自治县公安局永乐派出所","融水县局");
            put("广西融水苗族自治县公安局怀宝派出所","融水县局");
            put("广西融水苗族自治县公安局大年派出所","融水县局");
            put("广西融水苗族自治县公安局白云派出所","融水县局");
            put("广西融水苗族自治县公安局安陲派出所","融水县局");
            put("广西融水苗族自治县公安局洞头派出所","融水县局");
            put("广西融水苗族自治县公安局良寨派出所","融水县局");
            put("广西融水苗族自治县公安局拱洞派出所","融水县局");
            put("广西融安县公安局刑事侦查大队","融安县局");
            put("广西融安县公安局沙子派出所","融安县局");
            put("广西融安县公安局潭头派出所","融安县局");
            put("广西融安县公安局长安派出所","融安县局");
            put("广西鹿寨县公安局刑事侦查大队","鹿寨县局");
            put("广西鹿寨县公安局寨沙派出所","鹿寨县局");
            put("广西鹿寨县公安局导江派出所","鹿寨县局");
            put("广西鹿寨县公安局城北派出所","鹿寨县局");
            put("广西鹿寨县公安局城南派出所","鹿寨县局");
            put("广西鹿寨县公安局中渡派出所","鹿寨县局");
            put("广西鹿寨县公安局四排派出所","鹿寨县局");
            put("广西鹿寨县公安局平山派出所","鹿寨县局");
            put("广西柳城县公安局龙头派出所","柳城县局");
            put("广西柳城县公安局大埔派出所","柳城县局");
            put("广西柳城县公安局寨隆派出所","柳城县局");
            put("广西柳城县公安局刑事侦查大队","柳城县局");
            put("广西柳城县公安局沙埔派出所","柳城县局");
            put("广西柳城县公安局古砦派出所","柳城县局");
            put("广西柳城县公安局东泉派出所","柳城县局");
            put("广西柳城县公安局六塘派出所","柳城县局");
            put("广西柳城县公安局太平派出所","柳城县局");
            put("广西柳城县公安局社冲派出所","柳城县局");
            put("广西柳城县公安局狮子山派出所","柳城县局");
            put("广西柳城县公安局马山派出所","柳城县局");
            put("广西柳城县公安局西安派出所","柳城县局");
            put("广西柳州市公安局刑事侦查支队阳和责任区刑侦大队","柳东分局");
            put("广西柳州市公安局刑事侦查支队官塘责任区刑侦大队","柳东分局");
            put("广西柳州市公安局刑事侦查支队花岭责任区刑侦大队","柳东分局");
            put("广西柳州市公安局官塘派出所","柳东分局");
            put("广西柳州市公安局刑事侦查支队拉堡责任区刑事侦查大队","柳江分局");
            put("广西柳州市公安局拉堡派出所","柳江分局");
            put("广西柳州市公安局里高派出所","柳江分局");
            put("广西柳州市公安局刑事侦查支队城东责任区刑事侦查大队","柳江分局");
            put("广西柳州市公安局新兴派出所","柳江分局");
            put("广西柳州市公安局三都派出所","柳江分局");
            put("广西柳州市公安局进德派出所","柳江分局");
            put("广西柳州市公安局穿山派出所","柳江分局");
            put("广西柳州市公安局城东派出所","柳江分局");
            put("广西柳州市公安局土博派出所","柳江分局");
            put("广西柳州市公安局百朋派出所","柳江分局");
            put("广西柳州市公安局成团派出所","柳江分局");
            put("广西柳州市公安局胜利派出所","柳北分局");
            put("广西柳州市公安局雀儿山派出所","柳北分局");
            put("广西柳州市公安局刑事侦查支队解放责任区刑侦大队","柳北分局");
            put("广西柳州市公安局刑事侦查支队柳长责任区刑侦大队","柳北分局");
            put("广西柳州市公安局沙塘派出所","柳北分局");
            put("广西柳州市公安局解放派出所","柳北分局");
            put("广西柳州市公安局长塘派出所","柳北分局");
            put("广西柳州市公安局石碑坪派出所","柳北分局");
            put("广西柳州市公安局北雀派出所","柳北分局");
            put("广西柳州市公安局黄村派出所","柳北分局");
            put("广西柳州市公安局刑事侦查支队雀儿山责任区刑侦大队","柳北分局");
            put("广西柳州市公安局刑事侦查支队西鹅责任区刑侦大队","柳南分局");
            put("广西柳州市公安局鹅山派出所","柳南分局");
            put("广西柳州市公安局西环派出所","柳南分局");
            put("广西柳州市公安局刑事侦查支队河西责任区刑侦大队","柳南分局");
            put("广西柳州市公安局南站派出所","柳南分局");
            put("广西柳州市公安局银山派出所","柳南分局");
            put("广西柳州市公安局刑事侦查支队红光责任区刑侦大队","柳南分局");
            put("广西柳州市公安局五里卡派出所","柳南分局");
            put("广西柳州市公安局洛满派出所","柳南分局");
            put("广西柳州市公安局西鹅派出所","柳南分局");
            put("广西柳州市公安局柳石派出所","柳南分局");
            put("广西柳州市公安局柳南派出所","柳南分局");
            put("广西柳州市公安局河西派出所","柳南分局");
            put("广西柳州市公安局河西工业园派出所","柳南分局");
            put("广西柳州市公安局太阳村派出所","柳南分局");
            put("广西柳州市公安局刑事侦查支队桂中责任区刑侦大队","城中分局");
            put("广西柳州市公安局刑事侦查支队河东责任区刑侦大队","城中分局");
            put("广西柳州市公安局刑事侦查支队五星责任区刑侦大队","城中分局");
            put("广西柳州市公安局天马派出所","鱼峰分局");
            put("广西柳州市公安局大桥派出所","鱼峰分局");
            put("广西柳州市公安局刑事侦查支队箭盘责任区刑侦大队","鱼峰分局");
            put("广西柳州市公安局加合派出所","鱼峰分局");
            put("广西柳州市公安局刑事侦查支队鸡喇责任区刑侦大队","鱼峰分局");
            put("广西柳州市公安局鸡喇派出所","鱼峰分局");
            put("广西柳州市公安局刑事侦查支队天马责任区刑侦大队","鱼峰分局");
            put("广西柳州市公安局箭盘山派出所","鱼峰分局");
            put("广西柳州市公安局荣军派出所","鱼峰分局");
            put("河东派出所","三江县局");
            put("城南派出所","融水县局");
            put("城北派出所","融水县局");
            put("红水派出所","融水县局");
            put("城东派出所","融水县局");
            put("汪洞派出所","融水县局");
            put("四荣派出所","融水县局");
            put("永乐派出所","融水县局");
            put("怀宝派出所","融水县局");
            put("大年派出所","融水县局");
            put("白云派出所","融水县局");
            put("安陲派出所","融水县局");
            put("洞头派出所","融水县局");
            put("良寨派出所","融水县局");
            put("拱洞派出所","融水县局");
            put("沙子派出所","融安县局");
            put("潭头派出所","融安县局");
            put("长安派出所","融安县局");
            put("寨沙派出所","鹿寨县局");
            put("导江派出所","鹿寨县局");
            put("城北派出所","鹿寨县局");
            put("城南派出所","鹿寨县局");
            put("中渡派出所","鹿寨县局");
            put("四排派出所","鹿寨县局");
            put("平山派出所","鹿寨县局");
            put("龙头派出所","柳城县局");
            put("大埔派出所","柳城县局");
            put("寨隆派出所","柳城县局");
            put("沙埔派出所","柳城县局");
            put("古砦派出所","柳城县局");
            put("东泉派出所","柳城县局");
            put("六塘派出所","柳城县局");
            put("太平派出所","柳城县局");
            put("社冲派出所","柳城县局");
            put("狮子山派出所","柳城县局");
            put("马山派出所","柳城县局");
            put("西安派出所","柳城县局");
            put("阳和责任区刑侦大队","柳东分局");
            put("官塘责任区刑侦大队","柳东分局");
            put("花岭责任区刑侦大队","柳东分局");
            put("官塘派出所","柳东分局");
            put("拉堡责任区刑事侦查大队","柳江分局");
            put("拉堡派出所","柳江分局");
            put("里高派出所","柳江分局");
            put("城东责任区刑事侦查大队","柳江分局");
            put("新兴派出所","柳江分局");
            put("三都派出所","柳江分局");
            put("进德派出所","柳江分局");
            put("穿山派出所","柳江分局");
            put("城东派出所","柳江分局");
            put("土博派出所","柳江分局");
            put("百朋派出所","柳江分局");
            put("成团派出所","柳江分局");
            put("胜利派出所","柳北分局");
            put("雀儿山派出所","柳北分局");
            put("解放责任区刑侦大队","柳北分局");
            put("柳长责任区刑侦大队","柳北分局");
            put("沙塘派出所","柳北分局");
            put("解放派出所","柳北分局");
            put("长塘派出所","柳北分局");
            put("石碑坪派出所","柳北分局");
            put("北雀派出所","柳北分局");
            put("黄村派出所","柳北分局");
            put("雀儿山责任区刑侦大队","柳北分局");
            put("西鹅责任区刑侦大队","柳南分局");
            put("鹅山派出所","柳南分局");
            put("西环派出所","柳南分局");
            put("河西责任区刑侦大队","柳南分局");
            put("南站派出所","柳南分局");
            put("银山派出所","柳南分局");
            put("红光责任区刑侦大队","柳南分局");
            put("五里卡派出所","柳南分局");
            put("洛满派出所","柳南分局");
            put("西鹅派出所","柳南分局");
            put("柳石派出所","柳南分局");
            put("柳南派出所","柳南分局");
            put("河西派出所","柳南分局");
            put("河西工业园派出所","柳南分局");
            put("太阳村派出所","柳南分局");
            put("桂中责任区刑侦大队","城中分局");
            put("河东责任区刑侦大队","城中分局");
            put("五星责任区刑侦大队","城中分局");
            put("天马派出所","鱼峰分局");
            put("大桥派出所","鱼峰分局");
            put("箭盘责任区刑侦大队","鱼峰分局");
            put("加合派出所","鱼峰分局");
            put("鸡喇责任区刑侦大队","鱼峰分局");
            put("鸡喇派出所","鱼峰分局");
            put("天马责任区刑侦大队","鱼峰分局");
            put("箭盘山派出所","鱼峰分局");
            put("荣军派出所","鱼峰分局");
            put("鹿寨县局公安局黄冕派出所","鹿寨县局");
            put("三江县局公安局同乐派出所","三江县局");
            put("融安县局公安局大坡派出所","融安县局");
            put("广西柳州市公安局出入境管理支队三大队","柳州市局");
            put("广西柳州市公安局雒容派出所","柳东分局");
            put("鹿寨县局公安局经济犯罪侦查大队","鹿寨县局");
            put("融水县局公安局三防派出所","融水县局");
            put("广西柳州市公安局刑事侦查支队五里卡责任区刑侦大队","柳南分局");
            put("融水县局公安局滚贝派出所","融水县局");
            put("柳城县局公安局凤山派出所","柳城县局");
            put("融水县局公安局和睦派出所","融水县局");
            put("融水县局公安局大浪派出所","融水县局");
            put("广西柳州市公安局里雍派出所","鱼峰分局");
            put("融水县局公安局杆洞派出所","融水县局");
            put("三江县局公安局良口派出所","三江县局");
            put("融安县局公安局浮石派出所","融安县局");
            put("融安县局公安局板榄派出所","融安县局");
            put("广西柳州市公安局桂中派出所","城中分局");
            put("广西柳州市公安局白沙派出所","鱼峰分局");
            put("三江县局公安局斗江派出所","三江县局");
            put("柳城县局公安局经济犯罪侦查大队","柳城县局");
        }
    };
    public static String getJurisdiction(String name){
        if (StringUtils.isEmpty(name)){
            return name;
        }
        name = name.replaceAll("\\s+","");
        if (name.contains("柳城")){
            return "柳城县局";
        }else if (name.contains("鹿寨")){
            return "鹿寨县局";
        }else if (name.contains("融安")){
            return "融安县局";
        }else if (name.contains("融水")){
            return "融水县局";
        }else if (name.contains("三江")){
            return "三江县局";
        }else if (name.contains("城中")){
            return "城中分局";
        }else if (name.contains("鱼峰")){
            return "鱼峰分局";
        }else if (name.contains("柳南")){
            return "柳南分局";
        }else if (name.contains("柳北")){
            return "柳北分局";
        }else if (name.contains("柳江")){
            return "柳江分局";
        }else if (name.contains("柳东")){
            return "柳东分局";
        }
        return map.get(name);
    }

    public static String getJurisdictionFullName(String name){
        name = name.replaceAll("\\s+","");
        if (name.contains("城中")){
            return "柳州市公安局城中分局";
        }else if (name.contains("鱼峰")){
            return "柳州市公安局鱼峰分局";
        }else if (name.contains("柳北")){
            return "柳州市公安局柳北分局";
        }else if (name.contains("柳南")){
            return "柳州市公安局柳南分局";
        }else if (name.contains("柳江")){
            return "柳州市公安局柳江分局";
        }else if (name.contains("柳东")){
            return "柳州市公安局柳东分局";
        }else if (name.contains("柳城")){
            return "柳城县公安局";
        }else if (name.contains("鹿寨")){
            return "鹿寨县公安局";
        }else if (name.contains("融安")){
            return "融安县公安局";
        }else if (name.contains("融水")){
            return "融水苗族自治县公安局";
        }else if (name.contains("三江")){
            return "三江侗族自治县公安局";
        }else{
            return name;
        }
    }
}
